app/views/memberships/show.html.erb

SELECT "memberships".* FROM "memberships" ORDER BY "memberships"."level" ASC
---
      <%= form_tag(memberships_path, method: :get) do %>
          <%= text_field_tag :term, params[:term], style: 'width: 50%;', placeholder: 'Search', data: { autocomplete_source: Membership.order(:level).map(&:level)} %>