app/views/price_change_histories/edit.html.erb

            <div class="input-field col s6">
              <%= collection_select :price_change_history, :dish_id, Dish.all, :id, :dish_name, prompt: true %>
---
SELECT "dishes".* FROM "dishes"