app/views/price_change_histories/new.html.erb

SELECT "dishes".* FROM "dishes"
---
            <div class="input-field col s6">
              <%= collection_select :price_change_history, :dish_id, Dish.all, :id, :dish_name, prompt: true %>