app/views/price_change_histories/show.html.erb

SELECT "dishes".* FROM "dishes" ORDER BY "dishes"."dish_name" ASC
SELECT "price_change_histories".* FROM "price_change_histories" ORDER BY "price_change_histories"."dish_name" ASC
---
        <div class="input-field">
          <%= collection_select :price_change_history, :dish_id, Dish.all, :id, :dish_name, prompt: true %>