app/views/discount_days/edit.html.erb

          <option value="" disabled selected>Choose your option</option>
          <%= Dish.all.each do |dish| %>
---
SELECT "dishes".* FROM "dishes"