app/views/discount_days/new.html.erb

SELECT "dishes".* FROM "dishes"
---
                  <option selected disabled>Select Discount Item</option>
                  <%= Dish.all.each do |dish| %>