app/views/discount_days/show.html.erb

SELECT "dishes".* FROM "dishes"
---
              <option value="" disabled selected>Choose your option</option>
              <%= Dish.all.each do |dish| %>