app/views/discount_days/show.html.erb

SELECT "discount_days".* FROM "discount_days" ORDER BY "discount_days"."name" ASC
SELECT COUNT(*) FROM "discount_days" WHERE (lower(name) LIKE '%quoc khanh%' AND (discount_days.from_day >= current_date OR (discount_days.to_day >= current_date AND discount_days.from_day <= current_date)))
---
      <%= form_tag(discount_days_path, method: :get) do %>
          <%= text_field_tag :term, params[:term], style: 'width: 70%;', placeholder: 'Search', data: {autocomplete_source: DiscountDay.order(:name).map(&:name)} %>

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <% discount_item_id.each do |item| %>
                    <%= Dish.find(item).dish_name %>,
                <% end %>