app/views/users/edit.html.erb

SELECT "roles".* FROM "roles"
---
      <div class="input-field">
        <%= collection_select :user, :role_id, Role.all, :id, :name, prompt: true %>

SELECT "memberships".* FROM "memberships"
---
      <div class="input-field">
        <%= collection_select :user, :membership_id, Membership.all, :id, :level, prompt: true %>