app/views/users/show.html.erb

      <%= form_tag(users_path, method: :get) do %>
          <%= text_field_tag :term, params[:term], style: 'width: 70%;', placeholder: 'Search', data: {autocomplete_source: User.order(:full_name).map(&:full_name)} %>
---
SELECT "users".* FROM "users" ORDER BY "users"."full_name" ASC