app/views/dishes/edit.html.erb

SELECT "categories".* FROM "categories"
---
      <div class="input-field">
        <%= collection_select :dish, :category_id, Category.all, :id, :category_name, prompt: true %>