app/views/dishes/new.html.erb

                <div class="input-field">
                  <%= collection_select :dish, :category_id, Category.all, :id, :category_name, prompt: true %>
---
SELECT "categories".* FROM "categories"