app/views/dishes/show.html.erb

SELECT "dishes".* FROM "dishes" WHERE (lower(dish_name) LIKE '%seasoning %')
---
      <%= form_tag(dishes_path, method: :get) do %>
          <%= text_field_tag :term, params[:term], style: 'width: 50%;', placeholder: 'Search', data: { autocomplete_source: Dish.order(:dish_name).map(&:dish_name)} %>