app/views/dishes/show.html.erb

SELECT "categories".* FROM "categories"
SELECT "dishes".* FROM "dishes"
---
        <div class="input-field">
          <%= collection_select :dish, :category_id, Category.all, :id, :category_name, prompt: true %>