app/controllers/discount_days_controller.rb

  def show
    if !params[:term].nil? && params[:term] != ''
      @discount_days = DiscountDay.search(params[:term]).paginate(page: params[:page], per_page: 10)
---
SELECT  "discount_days".* FROM "discount_days" WHERE (lower(name) LIKE '%quoc khanh%' AND (discount_days.from_day >= current_date OR (discount_days.to_day >= current_date AND discount_days.from_day <= current_date))) LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "discount_days" WHERE (lower(name) LIKE '%quoc khanh%' AND (discount_days.from_day >= current_date OR (discount_days.to_day >= current_date AND discount_days.from_day <= current_date)))

  def create
    @discount_day = DiscountDay.new discount_day_params
    @discount_day.save
---
INSERT INTO "discount_days" ("from_day", "to_day", "discount_item", "name", "image", "discount_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @discount_day = DiscountDay.find params[:id]
---
SELECT  "discount_days".* FROM "discount_days" WHERE "discount_days"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @discount_day = DiscountDay.find params[:discount_day][:id]
    @discount_day.update_attributes(discount_day_params)
---
SELECT  "discount_days".* FROM "discount_days" WHERE "discount_days"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "discount_days" SET "discount_item" = $1, "updated_at" = $2, "image" = $3 WHERE "discount_days"."id" = $4  [["discount_item", "1,2,3,4,5"], ["updated_at", "2017-06-21 03:54:23.413617"], ["image", "c79a76a2a32f7fd86b85250b62fbd872767bf0b8575690c173b54f9807217189.jpg"], ["id", 1]]