app/controllers/dishes_controller.rb

    def create
        @dish = Dish.new dish_params
        @dish.is_available = true
        @dish.save
---
INSERT INTO "dishes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-06-20 08:07:20.065641"], ["updated_at", "2017-06-20 08:07:20.065641"]]

    def show
        if !params[:term].nil? && params[:term] != ''
            @dishes = Dish.search_by_phong(params[:term]).paginate(page: params[:page], per_page: 10)
---
SELECT  "dishes".* FROM "dishes" WHERE (lower(dish_name) LIKE '%%') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "dishes" WHERE (lower(dish_name) LIKE '%%')

    def update_status
        respond_to do |format|
            format.json {
                @dish = Dish.find params[:id]
                if @dish.is_available.nil?
                    @dish.update is_available: false
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 109], ["LIMIT", 1]]
UPDATE "dishes" SET "status" = $1, "updated_at" = $2 WHERE "dishes"."id" = $3  [["status", "t"], ["updated_at", "2017-06-20 07:06:24.573358"], ["id", 109]]

    def edit
        @dish = Dish.find params[:id]
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 109], ["LIMIT", 1]]

    def update
        @dish = Dish.find params[:dish][:id]
        @dish.update_attributes(dish_params)
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 183], ["LIMIT", 1]]
UPDATE "dishes" SET "image" = $1, "status" = $2, "updated_at" = $3 WHERE "dishes"."id" = $4  [["image", "fd9eb9dcccc34a7fec08ed3dbd744787c92293a490fc180e998478e7bb1c2641.jpg"], ["status", "f"], ["updated_at", "2017-06-20 09:00:46.998587"], ["id", 182]]