app/controllers/memberships_controller.rb

  def show
    if !params[:term].nil? && params[:term] != ''
      @memberships = Membership.search(params[:term]).paginate(page: params[:page], per_page: 10)
---
SELECT  "memberships".* FROM "memberships" WHERE (lower(level) LIKE '%silver%') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "memberships" WHERE (lower(level) LIKE '%silver%')

  def create
    @membership = Membership.new membership_params
    @membership.save
---
INSERT INTO "memberships" ("mark_boundary", "discount_rate", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["mark_boundary", 123.0], ["discount_rate", 123.0], ["level", "phong level"], ["created_at", "2017-06-21 04:14:54.277659"], ["updated_at", "2017-06-21 04:14:54.277659"]]

  def edit
    @membership = Membership.find params[:id]
---
SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    @membership = Membership.find params[:membership][:id]
    @membership.update_attributes(level: params[:membership][:level], mark_boundary: params[:membership][:mark_boundary], discount_rate: params[:membership][:discount_rate])
---
SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "memberships" SET "level" = $1, "mark_boundary" = $2, "discount_rate" = $3, "updated_at" = $4 WHERE "memberships"."id" = $5  [["level", "phong level update"], ["mark_boundary", 111.0], ["discount_rate", 111.0], ["updated_at", "2017-06-21 04:16:05.073106"], ["id", 6]]