app/controllers/price_change_histories_controller.rb

  def show
    if !params[:term].nil? && params[:term] != ''
      @price_change_histories = PriceChangeHistory.search(params[:term]).paginate(page: params[:page], per_page: 10)
---
SELECT "price_change_histories".* FROM "price_change_histories"

  def create
    @price_change_history = PriceChangeHistory.new price_history_params
    @price_change_history.save
---
INSERT INTO "price_change_histories" ("dish_id", "price", "from_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["dish_id", 1], ["price", "123123.0"], ["from_date", "2017-06-21 00:00:00"], ["created_at", "2017-06-21 03:29:16.468382"], ["updated_at", "2017-06-21 03:29:16.468382"]]

  def edit
    @price_change_history = PriceChangeHistory.find params[:id]
---
SELECT  "price_change_histories".* FROM "price_change_histories" WHERE "price_change_histories"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def update_status
    respond_to do |format|
      format.json {
        @price_change_history = PriceChangeHistory.find params[:id]
        if @price_change_history.status.nil?
          @price_change_history.update status: false
---
SELECT  "price_change_histories".* FROM "price_change_histories" WHERE "price_change_histories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "price_change_histories" SET "status" = $1, "updated_at" = $2 WHERE "price_change_histories"."id" = $3  [["status", "f"], ["updated_at", "2017-06-21 03:19:36.984501"], ["id", 1]]

  def update
    @price_change_history = PriceChangeHistory.find params[:price_change_history][:id]
    @price_change_history.update_attributes(price_history_params)
---
SELECT  "price_change_histories".* FROM "price_change_histories" WHERE "price_change_histories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "price_change_histories" SET "from_date" = $1, "updated_at" = $2 WHERE "price_change_histories"."id" = $3  [["from_date", "2017-06-20 00:00:00"], ["updated_at", "2017-06-21 03:27:21.514007"], ["id", 3]]