app/controllers/session_controller.rb

    def create
        user_password = params[:session][:password]
        user_username = params[:session][:username]
        user = user_username.present? && User.find_by(username: user_username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "dphong1995"], ["LIMIT", 1]]