app/controllers/statistic_controller.rb

  def index
    @user = Order.order('sum_total desc').includes(:user).group('users.username').select('users.username').references(:users).sum(:total).first
    @dish = OrderDetail.order('sum_quantity desc').includes(:dish).group('dishes.dish_name').references(:dishes).sum(:quantity).first
    @revenue = Order.sum(:total)
---
SELECT SUM("orders"."total") AS sum_total, users.username AS users_username FROM "orders" LEFT OUTER JOIN "users" ON "users"."id" = "orders"."user_id" WHERE (date_part('month', orders.created_at) = date_part('month', current_date)) GROUP BY users.username ORDER BY sum_total desc
SELECT SUM("order_details"."quantity") AS sum_quantity, dishes.dish_name AS dishes_dish_name FROM "order_details" LEFT OUTER JOIN "dishes" ON "dishes"."id" = "order_details"."dish_id" WHERE (date_part('month', order_details.created_at) = date_part('month', current_date)) GROUP BY dishes.dish_name
SELECT SUM("orders"."total") FROM "orders"

  def make_statistic
    respond_to do |format|
      format.html {

      }
      format.json {
        type = params[:type]
        duration = params[:duration]
        if type == 'user'
          if duration == 'month'
            render json: Order.order('sum_total desc').includes(:user).group('users.username').select('users.username').references(:users).where('date_part(\'month\', orders.created_at) = date_part(\'month\', current_date)').sum(:total).first(10).to_json
          elsif duration == 'year'
            render json: Order.order('sum_total desc').includes(:user).group('users.username').select('users.username').references(:users).where('date_part(\'year\', orders.created_at) = date_part(\'year\', current_date)').sum(:total).first(10).to_json
          else

          end
        elsif type == 'order'
          if duration == 'month'
            render json: Order.order('sum_total desc').where('date_part(\'month\', orders.created_at) = date_part(\'month\', current_date)').group_by_day_of_week(:created_at, format: "%a").sum(:total).to_json
          elsif duration == 'year'
            render json: Order.order('sum_total desc').where('date_part(\'year\', orders.created_at) = date_part(\'year\', current_date)').group_by_month(:created_at, format: "%b %Y").sum(:total).to_json
          else

          end
        else
          if duration == 'month'
            render json: OrderDetail.order('sum_quantity desc').includes(:dish).group('dishes.dish_name').references(:dishes).where('date_part(\'month\', order_details.created_at) = date_part(\'month\', current_date)').sum(:quantity).first(5).to_json
---
SELECT SUM("order_details"."quantity") AS sum_quantity, dishes.dish_name AS dishes_dish_name FROM "order_details" LEFT OUTER JOIN "dishes" ON "dishes"."id" = "order_details"."dish_id" WHERE (date_part('year', order_details.created_at) = date_part('year', current_date)) GROUP BY dishes.dish_name ORDER BY sum_quantity desc