app/controllers/tables_controller.rb

SELECT  "tables".* FROM "tables" WHERE (table_number = '1') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tables" WHERE (table_number = '1')
---
  def show
    if !params[:term].nil? && params[:term] != ''
      @tables = Table.search(params[:term]).paginate(page: params[:page], per_page: 10)

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @table = Table.find params[:id]

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tables" SET "table_number" = $1, "updated_at" = $2 WHERE "tables"."id" = $3  [["table_number", 12], ["updated_at", "2017-06-21 02:41:39.173293"], ["id", 2]]
---
  def update
    @table = Table.find params[:table][:id]
    @table.update_attributes(:table_number => params[:table][:table_number])

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tables" SET "status" = $1, "updated_at" = $2 WHERE "tables"."id" = $3  [["status", "f"], ["updated_at", "2017-06-26 03:47:50.693887"], ["id", 8]]
---
  def update_status
    respond_to do |format|
      format.json {
        @table = Table.find params[:id]
        if @table.status.nil?
          @table.update status: false