app/controllers/users_controller.rb

  def show
    if session[:role] == "manager"
      redirect_to balance_path
    end
    if !params[:term].nil? && params[:term] != ''
      @users = User.search(params[:term]).paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" WHERE (lower(full_name) LIKE '%phong%') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (lower(full_name) LIKE '%phong%')

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find params[:user][:id]
    @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["avatar", "#<ActionDispatch::Http::UploadedFile:0x10222a10>"], ["updated_at", "2017-06-20 09:38:06.592732"], ["id", 1]]