app/views/statistic/index.html.erb

SELECT SUM("orders"."total") AS sum_total, EXTRACT(DOW from created_at::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '0 second')::integer AS extract_dow_from_created_at_timestamptz_at_time_zone_etc_utc_in FROM "orders" WHERE (date_part('month', orders.created_at) = date_part('month', current_date)) AND (created_at IS NOT NULL) GROUP BY EXTRACT(DOW from created_at::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '0 second')::integer
SELECT SUM("orders"."total") AS sum_total, users.username AS users_username FROM "orders" LEFT OUTER JOIN "users" ON "users"."id" = "orders"."user_id" WHERE (date_part('month', orders.created_at) = date_part('month', current_date)) GROUP BY users.username ORDER BY sum_total desc
---
        <div id="data" class="row">
          <%= column_chart Order.includes(:user).group('users.username').select('users.username').references(:users).where('date_part(\'month\', orders.created_at) = date_part(\'month\', current_date)').sum(:total).first(10), id: 'column_chart' %>

SELECT SUM("order_details"."quantity") AS sum_quantity, dishes.dish_name AS dishes_dish_name FROM "order_details" LEFT OUTER JOIN "dishes" ON "dishes"."id" = "order_details"."dish_id" WHERE (date_part('month', order_details.created_at) = date_part('month', current_date)) GROUP BY dishes.dish_name
---
        var selected_type = type_select.options[type_select.selectedIndex];
        $.ajax({
            url: '/make_statistic.json',
            dataType: 'json',
            data: {
                type: selected_type.value,
                duration: duration
            },
            success: function (data) {
                var column_chart = Chartkick.charts["column_chart"];
                column_chart.updateData(data);
                if (selected_type.value == 'dish') {
                    if (!$('#duration').is(':checked')) {
                        $('#pie_data').html('<%= escape_javascript(pie_chart OrderDetail.includes(:dish).group('dishes.dish_name').references(:dishes).where('date_part(\'month\', order_details.created_at) = date_part(\'month\', current_date)').sum(:quantity)) %>')